УТ_для_edt/src/InformationRegisters/CRM_НастройкиПользователей/CRM_НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.CRM_НастройкиПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CRM_НастройкиПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/сфпНомераТелефоновДляПоиска/сфпНомераТелефоновДляПоиска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>сфпНомераТелефоновДляПоиска</name>
  <comment>Номера телефонов для поиска абонентов</comment>
  <resources>
    <name>НомерТелефона</name>
    <comment>Номер телефона</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <comment>Представление</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <comment>Пользователь</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ВнутреннийНомер</name>
    <comment>Внутренний номер</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерТелефонаДляПоиска</name>
    <comment>Номер телефона для полнотекстового поиска</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <comment>Объект для поиска</comment>
    <type>
      <types>DefinedType.сфпКонтактВзаимодействия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <comment>Вид номера</comment>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПорядковыйНомер</name>
    <comment>Номер строки табличной части</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_СостоянияЛидов/CRM_СостоянияЛидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_СостоянияЛидов</name>
  <comment>АПК:265 не проверять на орфографию имя</comment>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.CRM_СостоянияЛидов</types>
    </type>
  </resources>
  <resources>
    <name>СконвертированВОбъект</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
      <types>DocumentRef</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанСКлиентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПолучения</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКанала</name>
    <type>
      <types>EnumRef.CRM_ВидыКаналовПоступленияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.CRM_ПричиныОтклоненияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОбработку</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПричинаОтклонения</name>
    <type>
      <types>CatalogRef.CRM_ПричиныОтказаПоИнтересам</types>
    </type>
  </attributes>
  <dimensions>
    <name>Лид</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>CatalogRef.CRM_Диалоги</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.CRM_Заявка</types>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_СостояниеПользователейСинхронизации/CRM_СостояниеПользователейСинхронизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_СостояниеПользователейСинхронизации</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.CRM_СостоянияСинхронизацииПользователя</types>
    </type>
  </resources>
  <resources>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправкиПриглашения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетПодписку</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IMEI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/CRM_СостоянияСинхронизацииПользователя/CRM_СостоянияСинхронизацииПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_СостоянияСинхронизацииПользователя</name>
  <enumValues>
    <name>Активен</name>
  </enumValues>
  <enumValues>
    <name>Блокирован</name>
  </enumValues>
  <enumValues>
    <name>Отключен</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/CRM_СостоянияЛидов/CRM_СостоянияЛидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияЛидов</name>
  <comment>АПК:265 не проверять на орфографию имя</comment>
  <predefined>
    <items>
      <name>Новый</name>
      <description>Новое</description>
    </items>
    <items>
      <name>Отклонен</name>
      <description>Отклонено</description>
    </items>
    <items>
      <name>Повторный</name>
      <description>Повторное</description>
    </items>
    <items>
      <name>ПовторныйОбработанный</name>
      <description>Повторное (обработанное)</description>
    </items>
    <items>
      <name>Сконвертирован</name>
      <description>Сконвертировано</description>
    </items>
  </predefined>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/CRM_МетодыМодулейОбъектовСправочников/Module.bsl
#Область СлужебныеПроцедурыИФункции

#Область ПриЗаписи

Процедура ПриЗаписи(Источник, Отказ) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	#Область Пользователи

	Если НЕ Отказ Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	НастройкиПользователей.Пользователь КАК Пользователь
		                      |ИЗ
		                      |	РегистрСведений.CRM_НастройкиПользователей КАК НастройкиПользователей
		                      |ГДЕ
		                      |	НастройкиПользователей.Пользователь = &Пользователь");
		Запрос.УстановитьПараметр("Пользователь", Источник.Ссылка);
		Если Запрос.Выполнить().Пустой() Тогда
			// Создание настроек пользователя по умолчанию при первой записи.
			CRM_ПользователиПереопределяемый.CRM_ЗаполнитьНастройкиПользователяПоУмолчанию(Источник.Ссылка);
		КонецЕсли;
	КонецЕсли;

	#КонецОбласти // Пользователи

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполненияСправочников(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		Если ТипЗнч(Источник) = Тип("СправочникОбъект.Партнеры") И НЕ Источник.ЭтоГруппа Тогда
			Если Не Источник.Клиент И Не Источник.Конкурент И Не Источник.Поставщик И Не Источник.ПрочиеОтношения И Не Источник.Предопределенный Тогда
				Текст = НСтр("ru='Необходимо определить хотя бы один тип бизнес-отношений';en='It is necessary to define at least one type of business relations'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				Источник,
				"Клиент",
				,
				Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Справочник_Партнеры

// Осуществляет расширенный поиск партнеров.
//
// Параметры:
//  СписокПартнеров - таблица значений, заполняемая результатами поиска,
//
// Возвращаемое значение:
//   Неопределено если поиск произведен успешно.
//   Текст сообщения пользователю, если поиск неудачен.
//
Функция НайтиПартнеров(СтрокаПоиска, СписокПартнеров) Экспорт

	// настроить параметры поиска
	мОбластьПоиска = Новый Массив;
	мОбластьПоиска.Добавить(Метаданные.Справочники.Партнеры);
	мОбластьПоиска.Добавить(Метаданные.Справочники.КонтактныеЛицаПартнеров);
	мОбластьПоиска.Добавить(Метаданные.РегистрыСведений.сфпНомераТелефоновДляПоиска);
	РазмерПорции = 200;
	
	СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок(СтрокаПоиска, РазмерПорции);
	СписокПоиска.ОбластьПоиска = мОбластьПоиска;
	
	Попытка
		СписокПоиска.ПерваяЧасть();
	Исключение
		ИО = ИнформацияОбОшибке();
		Если Прав(СтрокаПоиска, 1) = "*" Тогда
			СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок("""" + Лев(СтрокаПоиска, СтрДлина(СтрокаПоиска) - 1) + """", РазмерПорции);
			СписокПоиска.ОбластьПоиска = мОбластьПоиска;
			СписокПоиска.ПерваяЧасть();
		Иначе
			ВызватьИсключение ПодробноеПредставлениеОшибки(ИО);
		КонецЕсли;
	КонецПопытки;
	
	// Возврат, если поиск не результативен.
	Если СписокПоиска.СлишкомМногоРезультатов() Тогда
		Возврат НСтр("ru='Слишком много результатов, уточните запрос.';en='It is too much results, specify query.'");
	ИначеЕсли СписокПоиска.ПолноеКоличество() = 0 Тогда
		Возврат НСтр("ru='Ничего не найдено';en='No results found'");
	КонецЕсли;
	КоличествоЭлементов = СписокПоиска.ПолноеКоличество();
	
	// Сформировать список найденных партнеров.
	СписокПартнеров.Очистить();
	НачальнаяПозиция = 0;
	КонечнаяПозиция = ?(КоличествоЭлементов>РазмерПорции,РазмерПорции,КоличествоЭлементов)-1;
	ЕстьСледующаяПорция = Истина;
	
	КИПредставлениеСиноним		= Метаданные.Справочники.Партнеры.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.Представление.Синоним;
	КИЗначенияПолейСиноним		= Метаданные.Справочники.Партнеры.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.ЗначенияПолей.Синоним;
	СтрокаПоискаВРег			= ВРег(СтрокаПоиска);
	
	// Обработать по порциям результаты ППД.
	Пока ЕстьСледующаяПорция Цикл
		Для СчетчикЭлементов = 0 По КонечнаяПозиция Цикл
			// Сформировать элемент результата.
			Элемент = СписокПоиска.Получить(СчетчикЭлементов);
			Если ТипЗнч(Элемент.Значение) = Тип("РегистрСведенийКлючЗаписи.сфпНомераТелефоновДляПоиска") Тогда
				Если ТипЗнч(Элемент.Значение.Объект) = Тип("СправочникСсылка.Партнеры") Или ТипЗнч(Элемент.Значение.Объект) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
					ЭлементСсылка = Элемент.Значение.Объект;
				Иначе
					Продолжить;
				КонецЕсли;
			Иначе
				ЭлементСсылка = Элемент.Значение.Ссылка;
			КонецЕсли;
			
			Если КоличествоЭлементов < 20 Тогда // Ограничение - если количество найденных много не будем усложнять описание.
				Если	Лев(Элемент.Описание, СтрДлина(КИПредставлениеСиноним)) = КИПредставлениеСиноним
					Или	Лев(Элемент.Описание, СтрДлина(КИЗначенияПолейСиноним)) = КИЗначенияПолейСиноним Тогда
					// Считаем, что нашли в контактной информации.
					бНайдено = Ложь;
					
					// Обход контактной информации вручную - попытка определить, где нашли.
					Для Каждого СтрокаТаблицы Из ЭлементСсылка.КонтактнаяИнформация Цикл
						Если	Найти(ВРег(СтрокаТаблицы.Представление),		СтрокаПоискаВРег) > 0
							Или	Найти(ВРег(СтрокаТаблицы.ЗначенияПолей),		СтрокаПоискаВРег) > 0
							Или	Найти(ВРег(СтрокаТаблицы.Страна),				СтрокаПоискаВРег) > 0
							Или	Найти(ВРег(СтрокаТаблицы.Регион),				СтрокаПоискаВРег) > 0
							Или	Найти(ВРег(СтрокаТаблицы.Город),				СтрокаПоискаВРег) > 0
							Или	Найти(ВРег(СтрокаТаблицы.АдресЭП),				СтрокаПоискаВРег) > 0
							Или	Найти(ВРег(СтрокаТаблицы.ДоменноеИмяСервера),	СтрокаПоискаВРег) > 0 Тогда
							//
							бНайдено = Истина;
							ЭлементОписание = СокрЛП(СтрокаТаблицы.Вид) + ": " + СтрокаТаблицы.Представление;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если Не бНайдено Тогда
						ЭлементОписание = Элемент.Описание;
					КонецЕсли;
				Иначе
					ЭлементОписание = Элемент.Описание;
				КонецЕсли;
			Иначе
				ЭлементОписание = Элемент.Описание;
			КонецЕсли;
			
			Попытка
				СтрПредставлениеОбъекта = Элемент.Метаданные.ПредставлениеОбъекта + " """;
				Основание = СтрПредставлениеОбъекта + Элемент.Представление + """ - " + ЭлементОписание;
			Исключение
				Если ТипЗнч(ЭлементСсылка) = Тип("СправочникСсылка.Партнеры") Тогда
					СтрПредставлениеОбъекта = НСтр("ru='Клиент';en='Client'") + " """ + Строка(ЭлементСсылка) + """";
				ИначеЕсли ТипЗнч(ЭлементСсылка) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
					СтрПредставлениеОбъекта = НСтр("ru='Контактное лицо';en='Contact Person'") + " """ + Строка(ЭлементСсылка) + """";
				Иначе
					СтрПредставлениеОбъекта = "";
				КонецЕсли;
				Если ТипЗнч(Элемент.Значение) = Тип("РегистрСведенийКлючЗаписи.сфпНомераТелефоновДляПоиска") Тогда
					НомерТелефона = ПолучитьНомерТелефонаПоЭлементуПоиска(Элемент.Значение.Объект, Элемент.Значение.Вид, Элемент.Значение.ПорядковыйНомер);
					Основание = "" + СтрПредставлениеОбъекта + "- " + "Номер Телефона: " + НомерТелефона ;
				Иначе
					Основание = ?(Не ЗначениеЗаполнено(СтрПредставлениеОбъекта), """" + Элемент.Представление + """", СтрПредставлениеОбъекта)
					+ " - " + ЭлементОписание;					
				КонецЕсли;					
				//
			КонецПопытки;
			
			Если ТипЗнч(ЭлементСсылка) = Тип("СправочникСсылка.Партнеры") Тогда
				Партнер = ЭлементСсылка;
			ИначеЕсли ТипЗнч(ЭлементСсылка) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
				Партнер = ЭлементСсылка.Владелец;
			Иначе
				Продолжить;
			КонецЕсли;
			Если НЕ ДобавитьПартнераВСписокНайденныхПолнотекстовымПоиском(СписокПартнеров,Партнер,Основание,ЭлементСсылка) Тогда
				Возврат НСтр("ru='Слишком много результатов, уточните запрос.';en='It is too much results, specify query.'");					
			КонецЕсли;
		КонецЦикла;
		НачальнаяПозиция = НачальнаяПозиция + РазмерПорции;
		ЕстьСледующаяПорция = (НачальнаяПозиция < КоличествоЭлементов - 1);
		Если ЕстьСледующаяПорция Тогда
			КонечнаяПозиция = 
			?(КоличествоЭлементов > НачальнаяПозиция + РазмерПорции, РазмерПорции,
			КоличествоЭлементов - НачальнаяПозиция) - 1;
			СписокПоиска.СледующаяЧасть();
		КонецЕсли;
	КонецЦикла;
	Если СписокПартнеров.Количество() = 0 Тогда
	     Возврат НСтр("ru='Ничего не найдено.';en='None found.'");		
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

Функция ДобавитьПартнераВСписокНайденныхПолнотекстовымПоиском(СписокПартнеров,Партнер,Основание,ЭлементСсылка)
	
	// Добавить элемент, если партнера еще нет в списке найденных.
	Если СписокПартнеров.Найти(Партнер,"Партнер") = Неопределено Тогда
		// Ограничить количество возвращаемых партнеров.
		Если СписокПартнеров.Количество() > 100 Тогда
			Возврат Ложь; 
		Иначе 
			Запись = СписокПартнеров.Добавить();
			Запись.Партнер = Партнер;
			Запись.Основание = Основание;
			Запись.Ссылка = ЭлементСсылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ДобавитьПартнераВСписокНайденныхПолнотекстовымПоиском()

// Функция возвращает представление телефона для найденного элемента полнотекстового поиска.
//
//  Параметры:
//   Объект - СправочникСсылка - Ссылка на найденный элемент.
//   Вид	- Вид контактной информации - Ссылка на вид КИ.
//   Порядковый номер - Число - Порядковый номер КИ (нужен для однозначного сопоставления).
//
//  Возвращаемое значение:
//   СтрокаПредставления - Строка - Представление найденного номера телефона.
//
Функция ПолучитьНомерТелефонаПоЭлементуПоиска(Объект, Вид, ПорядковыйНомер)
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	сфпНомераТелефоновДляПоиска.НомерТелефона,
	|	сфпНомераТелефоновДляПоиска.Представление
	|ИЗ
	|	РегистрСведений.сфпНомераТелефоновДляПоиска КАК сфпНомераТелефоновДляПоиска
	|ГДЕ
	|	сфпНомераТелефоновДляПоиска.Объект = &Объект
	|	И сфпНомераТелефоновДляПоиска.Вид = &Вид
	|	И сфпНомераТелефоновДляПоиска.ПорядковыйНомер = &ПорядковыйНомер";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Вид", Вид);
	запрос.УстановитьПараметр("ПорядковыйНомер", ПорядковыйНомер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Представление;
	Иначе
		Возврат "";
	КонецЕсли;		
	
КонецФункции	

Процедура CRM_ПередЗаписьюЛида(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Источник.Ответственный) И ЗначениеЗаполнено(Источник.CRM_РольОтветственного) Тогда
		Источник.CRM_РольОтветственного = Справочники.РолиИсполнителей.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

Процедура CRM_ПриЗаписиЛида(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Удалим признак лида при пометке удаления
	Если Источник.ПометкаУдаления Тогда
		РегистрыСведений.CRM_СостоянияЛидов.УдалитьСостояниеЛида(Источник.Ссылка);
	КонецЕсли;
	
	// Если мы указали причину отказа - установим ее и для основания-Заявки.
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ТелефонныйЗвонок") Тогда
		
		Если ЗначениеЗаполнено(Источник.ВзаимодействиеОснование) И ТипЗнч(Источник.ВзаимодействиеОснование) = Тип("ДокументСсылка.CRM_Заявка") Тогда
			
			Если РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(Источник.Ссылка) Тогда
				
				СтруктураСостоянияЗвонка = РегистрыСведений.CRM_СостоянияЛидов.ПолучитьТекущееСостояниеЛида(Источник.Ссылка);
				Если СтруктураСостоянияЗвонка <> Неопределено Тогда
					СостояниеЗвонка = СтруктураСостоянияЗвонка.Состояние;
					
					Если СостояниеЗвонка = Справочники.CRM_СостоянияЛидов.Отклонен Тогда
						
						ПричинаОтклоненияЗвонка = СтруктураСостоянияЗвонка.ПричинаОтклонения;
						КомментарийСостоянияЗвонка = СтруктураСостоянияЗвонка.Комментарий;
						
						Если РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(Источник.ВзаимодействиеОснование) Тогда
							СтруктураСостоянияЗаявки = РегистрыСведений.CRM_СостоянияЛидов.ПолучитьТекущееСостояниеЛида(Источник.ВзаимодействиеОснование);
							
							Если СтруктураСостоянияЗаявки <> Неопределено Тогда
								СостояниеЗаявки = СтруктураСостоянияЗаявки.Состояние;
								
								Если СостояниеЗаявки = Справочники.CRM_СостоянияЛидов.Отклонен Тогда
									ПричинаОтклоненияЗаявки = СтруктураСостоянияЗаявки.ПричинаОтклонения;
									Если НЕ ЗначениеЗаполнено(ПричинаОтклоненияЗаявки) Тогда
										// запишем состояние заявки по данным звонка
										РегистрыСведений.CRM_СостоянияЛидов.ЗаписатьСостояниеЛида(Источник.ВзаимодействиеОснование, Справочники.CRM_СостоянияЛидов.Отклонен,, ПричинаОтклоненияЗвонка, КомментарийСостоянияЗвонка); 
									КонецЕсли;
									
								Иначе
									// запишем состояние заявки по данным звонка
									РегистрыСведений.CRM_СостоянияЛидов.ЗаписатьСостояниеЛида(Источник.ВзаимодействиеОснование, Справочники.CRM_СостоянияЛидов.Отклонен,, ПричинаОтклоненияЗвонка, КомментарийСостоянияЗвонка); 
									
								КонецЕсли;
								
							Иначе
								// запишем состояние заявки по данным звонка
								РегистрыСведений.CRM_СостоянияЛидов.ЗаписатьСостояниеЛида(Источник.ВзаимодействиеОснование, Справочники.CRM_СостоянияЛидов.Отклонен,, ПричинаОтклоненияЗвонка, КомментарийСостоянияЗвонка); 
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура CRM_ПриЗаписиПользователяДляiCRMПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.Недействителен И НЕ РаботаВМоделиСервиса.РазделениеВключено() Тогда
		НаборЗаписей = РегистрыСведений.CRM_СостояниеПользователейСинхронизации.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пользователь.Установить(Источник.Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0 Тогда
			Для Каждого Запись Из НаборЗаписей Цикл
				Запись.Состояние = Перечисления.CRM_СостоянияСинхронизацииПользователя.Блокирован;
			КонецЦикла;	
			НаборЗаписей.Записать(Истина);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти //Справочник_Партнеры

#КонецОбласти
